[
  "What products and services do you offer? We sell hydraulic pumps, motors, and valves, manifolds, and filter elements. We also offer fluid analysis and general industrial purchasing services for international end users.",
  "What kind of fluid analysis do you offer? We offer a full range of fluid analysis for preventive maintenance. A list of the range of fluid analysis tests can be seen here: https://www.tu.biz/services/fluid-analysis",
  "What kind of hydraulic pumps do you have? We have hydraulic piston pumps, vane pumps, and small gear pumps.",
  "What time do you open and close? Hours of operation are between 8 a.m. to 4 p.m.  Eastern United States time.",
  "We are located in the state of Michigan, in the United States of America",
  "What kind of pistons pums do you have? Many of our piston pumps are interchanges with Vickers and Rexroth A10V and A4V series. We offer multiple displacements with different types of controls such as pressure compensated, load sensing, and HP limiter control.  More information about piston pumps here: https://www.tu.biz/products/piston-pumps.",
  "What kind of hydraulic pumps do you offer? Many of our hydraulic vane pumps are direct interchanges with Vickers and Parker-Denison units. Internal and external components are usually a direct interchange. More information about vane pumps here: https://www.tu.biz/products/vane-pumps ",
  "What kind of valves do you offer? We offer directional control valves in standard D03 and D05 mountings with many standard spools. We also offer a range of pressure control control valves, flow control valves, among others.",
  "What is the best way to contact sales? Best way to contact sales is by sending an email to info@tu.biz, or through contact page: https://www.tu.biz/contact-us.",
  "Who is Edgar Lindo? Edgar Lindo is my programmer.  He also created this page, more information about Edgar Lindo can be found here: https://www.edgarlindo.com/",
  "What is your warranty? Warranty is a one year long from the shipping date of the products.",
  "Do you offer technical asistance for your products? We offer help on selecting components depending on application. You can also have general Fluid Power engineering reference by visiting our Fluid Power formula page here: https://www.tu.biz/fluid-power-formulas ",
  "What kind of hydraulic filters do you offer? We offer interchangeable hydraulic filter elements to replace many different brands.",
  "Can you create a chatbot for me? You can ask Edgar Lindo if he would be interested in work with you via email at info@tu.biz ",
  "What can I do to order proudcts from you? You can ask for a quote, then send a purchase order.  You can find a purchase order form template here: www.tu.biz/forms/purchase-order.xls  ",
  "What is your name?  My name is AI-Luis. I was named after my creator Edgar Luis Lindo. ",
  " Would you be interested in selling my products? If you offer industrial products you can always send information to info@tu.biz.  Edgar Lindo is always interested in additional industrial products to offer to his customers. ",
  "Do you offer closed loop / hydrostatic pumps?  Right now we only have open loop hydraulic pumps "
]
